## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 2 to change, 13 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                       NAME                                       |
|----------|----------------------------------------------------------------------------------|
| add      | `aws_s3_bucket_ownership_controls.maintenance_mode`                              |
|          | `aws_s3_object.maintenance_static_page_css_files[&quot;style.css&quot;]`                   |
|          | `aws_s3_object.maintenance_static_page_html_files[&quot;index-fr.html&quot;]`              |
|          | `aws_s3_object.maintenance_static_page_html_files[&quot;index.html&quot;]`                 |
|          | `aws_s3_object.maintenance_static_page_ico_files[&quot;favicon.ico&quot;]`                 |
|          | `aws_s3_object.maintenance_static_page_svg_files[&quot;site-unavailable.svg&quot;]`        |
| delete   | `aws_s3_bucket.firehose_waf_logs`                                                |
|          | `aws_s3_bucket_object.maintenance_static_page_css_files[&quot;style.css&quot;]`            |
|          | `aws_s3_bucket_object.maintenance_static_page_html_files[&quot;index-fr.html&quot;]`       |
|          | `aws_s3_bucket_object.maintenance_static_page_html_files[&quot;index.html&quot;]`          |
|          | `aws_s3_bucket_object.maintenance_static_page_ico_files[&quot;favicon.ico&quot;]`          |
|          | `aws_s3_bucket_object.maintenance_static_page_svg_files[&quot;site-unavailable.svg&quot;]` |
|          | `aws_s3_bucket_public_access_block.firehose_waf_logs`                            |
| update   | `aws_cloudfront_distribution.maintenance_mode`                                   |
|          | `aws_wafv2_web_acl.forms_acl`                                                    |
| recreate | `aws_s3_bucket.maintenance_mode`                                                 |
|          | `aws_s3_bucket_acl.maintenance_mode`                                             |
|          | `aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3`           |
|          | `aws_s3_bucket_public_access_block.maintenance_mode`                             |
|          | `aws_s3_bucket_server_side_encryption_configuration.maintenance_mode`            |
|          | `aws_s3_bucket_website_configuration.maintenance_mode`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_cloudfront_to_access_static_website_in_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_to_access_static_website_in_s3" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PGE1KRH6OS33",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_cloudfront_distribution.maintenance_mode will be updated in-place
  ~ resource "aws_cloudfront_distribution" "maintenance_mode" {
        id                             = "E2NX6QAIR13JTM"
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (21 unchanged attributes hidden)

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "gc-forms-application-maintenance-page.s3.ca-central-1.amazonaws.com" -> null
          - origin_id           = "MaintenanceMode" -> null

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/E2PGE1KRH6OS33" -> null
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "MaintenanceMode"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E2PGE1KRH6OS33"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.firehose_waf_logs will be destroyed
  # (because aws_s3_bucket.firehose_waf_logs is not in configuration)
  - resource "aws_s3_bucket" "firehose_waf_logs" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::forms-staging-terraform-waf-logs" -> null
      - bucket                      = "forms-staging-terraform-waf-logs" -> null
      - bucket_domain_name          = "forms-staging-terraform-waf-logs.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "forms-staging-terraform-waf-logs.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "forms-staging-terraform-waf-logs" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null

      - grant {
          - id          = "8ee828b5522b38b6797b8f886ed0b30f039d4eaa7ea331fa60669a6e0352d7e5" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "tf-s3-lifecycle-20211112190024126200000001" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 90 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.maintenance_mode must be replaced
-/+ resource "aws_s3_bucket" "maintenance_mode" {
      + acceleration_status         = (known after apply)
      ~ acl                         = "private" -> (known after apply)
      ~ arn                         = "arn:aws:s3:::gc-forms-application-maintenance-page" -> (known after apply)
      ~ bucket                      = "gc-forms-application-maintenance-page" -> "gc-forms-staging-application-maintenance-page" # forces replacement
      ~ bucket_domain_name          = "gc-forms-application-maintenance-page.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "gc-forms-application-maintenance-page.s3.ca-central-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1QDHH18159H29" -> (known after apply)
      ~ id                          = "gc-forms-application-maintenance-page" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PGE1KRH6OS33"
                        }
                      - Resource  = "arn:aws:s3:::gc-forms-application-maintenance-page/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "ca-central-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ website_domain              = "s3-website.ca-central-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "gc-forms-application-maintenance-page.s3-website.ca-central-1.amazonaws.com" -> (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "8ee828b5522b38b6797b8f886ed0b30f039d4eaa7ea331fa60669a6e0352d7e5" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - index_document = "index.html" -> null
        }
    }

  # aws_s3_bucket_acl.maintenance_mode must be replaced
-/+ resource "aws_s3_bucket_acl" "maintenance_mode" {
      ~ bucket = "gc-forms-application-maintenance-page" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "gc-forms-application-maintenance-page,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "8ee828b5522b38b6797b8f886ed0b30f039d4eaa7ea331fa60669a6e0352d7e5" -> null
                  - type = "CanonicalUser" -> null
                }
            }
          - owner {
              - id = "8ee828b5522b38b6797b8f886ed0b30f039d4eaa7ea331fa60669a6e0352d7e5" -> null
            }
        }
    }

  # aws_s3_bucket_object.maintenance_static_page_css_files["style.css"] will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page_css_files is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page_css_files" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css" -> null
      - etag                   = "92fa1c75f720e83330756f94b06aa8bf" -> null
      - force_destroy          = false -> null
      - id                     = "style.css" -> null
      - key                    = "style.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/style.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.maintenance_static_page_html_files["index-fr.html"] will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page_html_files is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page_html_files" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "5c195ef016b9e898437a543aba2301ac" -> null
      - force_destroy          = false -> null
      - id                     = "index-fr.html" -> null
      - key                    = "index-fr.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/index-fr.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.maintenance_static_page_html_files["index.html"] will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page_html_files is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page_html_files" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "f15e6aa2fd75c9b6b97d93d2b1fedfbd" -> null
      - force_destroy          = false -> null
      - id                     = "index.html" -> null
      - key                    = "index.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/index.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.maintenance_static_page_ico_files["favicon.ico"] will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page_ico_files is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page_ico_files" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "image/png" -> null
      - etag                   = "58bd7822fbbd5642104beae2b25a1b5b" -> null
      - force_destroy          = false -> null
      - id                     = "favicon.ico" -> null
      - key                    = "favicon.ico" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/favicon.ico" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_object.maintenance_static_page_svg_files["site-unavailable.svg"] will be destroyed
  # (because aws_s3_bucket_object.maintenance_static_page_svg_files is not in configuration)
  - resource "aws_s3_bucket_object" "maintenance_static_page_svg_files" {
      - acl                    = "private" -> null
      - bucket                 = "gc-forms-application-maintenance-page" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "1d263a8e324e88ea09c9b630de277c45" -> null
      - force_destroy          = false -> null
      - id                     = "site-unavailable.svg" -> null
      - key                    = "site-unavailable.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./static_website/site-unavailable.svg" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_bucket_ownership_controls.maintenance_mode will be created
  + resource "aws_s3_bucket_ownership_controls" "maintenance_mode" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3 must be replaced
-/+ resource "aws_s3_bucket_policy" "allow_cloudfront_to_access_static_website_in_s3" {
      ~ bucket = "gc-forms-application-maintenance-page" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "gc-forms-application-maintenance-page" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PGE1KRH6OS33"
                        }
                      - Resource  = "arn:aws:s3:::gc-forms-application-maintenance-page/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_public_access_block.firehose_waf_logs will be destroyed
  # (because aws_s3_bucket_public_access_block.firehose_waf_logs is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "firehose_waf_logs" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "forms-staging-terraform-waf-logs" -> null
      - id                      = "forms-staging-terraform-waf-logs" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.maintenance_mode must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "maintenance_mode" {
      ~ bucket                  = "gc-forms-application-maintenance-page" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "gc-forms-application-maintenance-page" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.maintenance_mode must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "maintenance_mode" {
      ~ bucket = "gc-forms-application-maintenance-page" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "gc-forms-application-maintenance-page" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_website_configuration.maintenance_mode must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "maintenance_mode" {
      ~ bucket           = "gc-forms-application-maintenance-page" # forces replacement -> (known after apply) # forces replacement
      ~ id               = "gc-forms-application-maintenance-page" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website.ca-central-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "gc-forms-application-maintenance-page.s3-website.ca-central-1.amazonaws.com" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.maintenance_static_page_css_files["style.css"] will be created
  + resource "aws_s3_object" "maintenance_static_page_css_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = "92fa1c75f720e83330756f94b06aa8bf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "style.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/style.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_html_files["index-fr.html"] will be created
  + resource "aws_s3_object" "maintenance_static_page_html_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "5c195ef016b9e898437a543aba2301ac"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index-fr.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index-fr.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_html_files["index.html"] will be created
  + resource "aws_s3_object" "maintenance_static_page_html_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "f15e6aa2fd75c9b6b97d93d2b1fedfbd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_ico_files["favicon.ico"] will be created
  + resource "aws_s3_object" "maintenance_static_page_ico_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "58bd7822fbbd5642104beae2b25a1b5b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_svg_files["site-unavailable.svg"] will be created
  + resource "aws_s3_object" "maintenance_static_page_svg_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "1d263a8e324e88ea09c9b630de277c45"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "site-unavailable.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/site-unavailable.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_wafv2_web_acl.forms_acl will be updated in-place
  ~ resource "aws_wafv2_web_acl" "forms_acl" {
        id            = "e8fc1b67-9d4d-4a29-8c94-65b37b30a231"
        name          = "GCForms"
        tags          = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 1 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRuleSet" -> null
          - priority = 5 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesCommonRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 6 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 7 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 5

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"

                  + rule_action_override {
                      + name = "GenericRFI_QUERYARGUMENTS"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "GenericRFI_BODY"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                  + rule_action_override {
                      + name = "SizeRestrictions_BODY"

                      + action_to_use {
                          + count {
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 6

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 7

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 12 to add, 2 to change, 13 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_css_files[\"style.css\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index-fr.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_ico_files[\"favicon.ico\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_svg_files[\"site-unavailable.svg\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_maintenance_mode_uri_paths"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
